IDEA Connection Link
ConnectionSrv.ReadFully Method
 ReadFully
 Namespace: IdeaRS.ConnectionService.Service
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public static byte[] ReadFully(
	Stream input
)
Public Shared Function ReadFully (
	input As Stream
) As Byte()
public:
static array<unsigned char>^ ReadFully(
	Stream^ input
)
Parameters
input
Type: System.IO.Stream
[Missing <param name="input"/> documentation for "M:IdeaRS.ConnectionService.Service.ConnectionSrv.ReadFully(System.IO.Stream)"]
Return Value
Type: Byte[]
[Missing <returns> documentation for "M:IdeaRS.ConnectionService.Service.ConnectionSrv.ReadFully(System.IO.Stream)"]
See Also
Reference
ConnectionSrv Class
IdeaRS.ConnectionService.Service Namespace